export const months = ["2026.01", "2026.02", "2026.03", "2026.04", "2026.05", "2026.06", "2026.07", "2026.08"] as const;

export const migrationData = [
  {
    "region": "전국",
    "values": [
      {
        "총전입": 568310,
        "총전출": 568310,
        "순이동": 0,
        "시도내이동-시군구내": 181918,
        "시도내이동-시군구간 전입": 174475,
        "시도내이동-시군구간 전출": 174475,
        "시도간전입": 211917,
        "시도간전출": 211917
      },
      {
        "총전입": 614712,
        "총전출": 614712,
        "순이동": 0,
        "시도내이동-시군구내": 186663,
        "시도내이동-시군구간 전입": 186442,
        "시도내이동-시군구간 전출": 186442,
        "시도간전입": 241607,
        "시도간전출": 241607
      },
      {
        "총전입": 609119,
        "총전출": 609119,
        "순이동": 0,
        "시도내이동-시군구내": 195430,
        "시도내이동-시군구간 전입": 177377,
        "시도내이동-시군구간 전출": 177377,
        "시도간전입": 236312,
        "시도간전출": 236312
      },
      {
        "총전입": 506067,
        "총전출": 506067,
        "순이동": 0,
        "시도내이동-시군구내": 176088,
        "시도내이동-시군구간 전입": 151472,
        "시도내이동-시군구간 전출": 151472,
        "시도간전입": 178507,
        "시도간전출": 178507
      },
      {
        "총전입": 466180,
        "총전출": 466180,
        "순이동": 0,
        "시도내이동-시군구내": 162120,
        "시도내이동-시군구간 전입": 140859,
        "시도내이동-시군구간 전출": 140859,
        "시도간전입": 163201,
        "시도간전출": 163201
      },
      {
        "총전입": 480857,
        "총전출": 480857,
        "순이동": 0,
        "시도내이동-시군구내": 171387,
        "시도내이동-시군구간 전입": 145685,
        "시도내이동-시군구간 전출": 145685,
        "시도간전입": 163785,
        "시도간전출": 163785
      },
      {
        "총전입": 467840,
        "총전출": 467840,
        "순이동": 0,
        "시도내이동-시군구내": 161873,
        "시도내이동-시군구간 전입": 147238,
        "시도내이동-시군구간 전출": 147238,
        "시도간전입": 158729,
        "시도간전출": 158729
      },
      {
        "총전입": 471013,
        "총전출": 471013,
        "순이동": 0,
        "시도내이동-시군구내": 158278,
        "시도내이동-시군구간 전입": 146672,
        "시도내이동-시군구간 전출": 146672,
        "시도간전입": 166063,
        "시도간전출": 166063
      }
    ]
  },
  {
    "region": "서울특별시",
    "values": [
      {
        "총전입": 120719,
        "총전출": 120824,
        "순이동": -105,
        "시도내이동-시군구내": 27268,
        "시도내이동-시군구간 전입": 49607,
        "시도내이동-시군구간 전출": 49607,
        "시도간전입": 43844,
        "시도간전출": 43949
      },
      {
        "총전입": 137348,
        "총전출": 133121,
        "순이동": 4227,
        "시도내이동-시군구내": 29676,
        "시도내이동-시군구간 전입": 54851,
        "시도내이동-시군구간 전출": 54851,
        "시도간전입": 52821,
        "시도간전출": 48594
      },
      {
        "총전입": 127284,
        "총전출": 127451,
        "순이동": -167,
        "시도내이동-시군구내": 29544,
        "시도내이동-시군구간 전입": 48707,
        "시도내이동-시군구간 전출": 48707,
        "시도간전입": 49033,
        "시도간전출": 49200
      },
      {
        "총전입": 105091,
        "총전출": 111432,
        "순이동": -6341,
        "시도내이동-시군구내": 27698,
        "시도내이동-시군구간 전입": 42905,
        "시도내이동-시군구간 전출": 42905,
        "시도간전입": 34488,
        "시도간전출": 40829
      },
      {
        "총전입": 95905,
        "총전출": 100126,
        "순이동": -4221,
        "시도내이동-시군구내": 25004,
        "시도내이동-시군구간 전입": 38802,
        "시도내이동-시군구간 전출": 38802,
        "시도간전입": 32099,
        "시도간전출": 36320
      },
      {
        "총전입": 95545,
        "총전출": 101242,
        "순이동": -5697,
        "시도내이동-시군구내": 24798,
        "시도내이동-시군구간 전입": 38999,
        "시도내이동-시군구간 전출": 38999,
        "시도간전입": 31748,
        "시도간전출": 37445
      },
      {
        "총전입": 96691,
        "총전출": 102799,
        "순이동": -6108,
        "시도내이동-시군구내": 25046,
        "시도내이동-시군구간 전입": 39695,
        "시도내이동-시군구간 전출": 39695,
        "시도간전입": 31950,
        "시도간전출": 38058
      },
      {
        "총전입": 103315,
        "총전출": 106216,
        "순이동": -2901,
        "시도내이동-시군구내": 25331,
        "시도내이동-시군구간 전입": 42155,
        "시도내이동-시군구간 전출": 42155,
        "시도간전입": 35829,
        "시도간전출": 38730
      }
    ]
  },
  {
    "region": "전남광주통합특별시",
    "values": [
      {
        "총전입": null,
        "총전출": null,
        "순이동": null,
        "시도내이동-시군구내": null,
        "시도내이동-시군구간 전입": null,
        "시도내이동-시군구간 전출": null,
        "시도간전입": null,
        "시도간전출": null
      },
      {
        "총전입": null,
        "총전출": null,
        "순이동": null,
        "시도내이동-시군구내": null,
        "시도내이동-시군구간 전입": null,
        "시도내이동-시군구간 전출": null,
        "시도간전입": null,
        "시도간전출": null
      },
      {
        "총전입": null,
        "총전출": null,
        "순이동": null,
        "시도내이동-시군구내": null,
        "시도내이동-시군구간 전입": null,
        "시도내이동-시군구간 전출": null,
        "시도간전입": null,
        "시도간전출": null
      },
      {
        "총전입": null,
        "총전출": null,
        "순이동": null,
        "시도내이동-시군구내": null,
        "시도내이동-시군구간 전입": null,
        "시도내이동-시군구간 전출": null,
        "시도간전입": null,
        "시도간전출": null
      },
      {
        "총전입": null,
        "총전출": null,
        "순이동": null,
        "시도내이동-시군구내": null,
        "시도내이동-시군구간 전입": null,
        "시도내이동-시군구간 전출": null,
        "시도간전입": null,
        "시도간전출": null
      },
      {
        "총전입": null,
        "총전출": null,
        "순이동": null,
        "시도내이동-시군구내": null,
        "시도내이동-시군구간 전입": null,
        "시도내이동-시군구간 전출": null,
        "시도간전입": null,
        "시도간전출": null
      },
      {
        "총전입": 25369,
        "총전출": 25813,
        "순이동": -444,
        "시도내이동-시군구내": 8698,
        "시도내이동-시군구간 전입": 11334,
        "시도내이동-시군구간 전출": 11334,
        "시도간전입": 5337,
        "시도간전출": 5781
      },
      {
        "총전입": 24829,
        "총전출": 25910,
        "순이동": -1081,
        "시도내이동-시군구내": 8555,
        "시도내이동-시군구간 전입": 10834,
        "시도내이동-시군구간 전출": 10834,
        "시도간전입": 5440,
        "시도간전출": 6521
      }
    ]
  },
  {
    "region": "부산광역시",
    "values": [
      {
        "총전입": 35933,
        "총전출": 36777,
        "순이동": -844,
        "시도내이동-시군구내": 9703,
        "시도내이동-시군구간 전입": 15488,
        "시도내이동-시군구간 전출": 15488,
        "시도간전입": 10742,
        "시도간전출": 11586
      },
      {
        "총전입": 40973,
        "총전출": 40816,
        "순이동": 157,
        "시도내이동-시군구내": 9840,
        "시도내이동-시군구간 전입": 17315,
        "시도내이동-시군구간 전출": 17315,
        "시도간전입": 13818,
        "시도간전출": 13661
      },
      {
        "총전입": 36200,
        "총전출": 37021,
        "순이동": -821,
        "시도내이동-시군구내": 9277,
        "시도내이동-시군구간 전입": 14779,
        "시도내이동-시군구간 전출": 14779,
        "시도간전입": 12144,
        "시도간전출": 12965
      },
      {
        "총전입": 28257,
        "총전출": 29297,
        "순이동": -1040,
        "시도내이동-시군구내": 7934,
        "시도내이동-시군구간 전입": 12266,
        "시도내이동-시군구간 전출": 12266,
        "시도간전입": 8057,
        "시도간전출": 9097
      },
      {
        "총전입": 27214,
        "총전출": 27621,
        "순이동": -407,
        "시도내이동-시군구내": 7601,
        "시도내이동-시군구간 전입": 11755,
        "시도내이동-시군구간 전출": 11755,
        "시도간전입": 7858,
        "시도간전출": 8265
      },
      {
        "총전입": 26523,
        "총전출": 27672,
        "순이동": -1149,
        "시도내이동-시군구내": 7521,
        "시도내이동-시군구간 전입": 11607,
        "시도내이동-시군구간 전출": 11607,
        "시도간전입": 7395,
        "시도간전출": 8544
      },
      {
        "총전입": 28248,
        "총전출": 28909,
        "순이동": -661,
        "시도내이동-시군구내": 7842,
        "시도내이동-시군구간 전입": 12772,
        "시도내이동-시군구간 전출": 12772,
        "시도간전입": 7634,
        "시도간전출": 8295
      },
      {
        "총전입": 27457,
        "총전출": 28088,
        "순이동": -631,
        "시도내이동-시군구내": 7389,
        "시도내이동-시군구간 전입": 11850,
        "시도내이동-시군구간 전출": 11850,
        "시도간전입": 8218,
        "시도간전출": 8849
      }
    ]
  },
  {
    "region": "대구광역시",
    "values": [
      {
        "총전입": 26338,
        "총전출": 26589,
        "순이동": -251,
        "시도내이동-시군구내": 6929,
        "시도내이동-시군구간 전입": 10649,
        "시도내이동-시군구간 전출": 10649,
        "시도간전입": 8760,
        "시도간전출": 9011
      },
      {
        "총전입": 28829,
        "총전출": 29254,
        "순이동": -425,
        "시도내이동-시군구내": 7334,
        "시도내이동-시군구간 전입": 11109,
        "시도내이동-시군구간 전출": 11109,
        "시도간전입": 10386,
        "시도간전출": 10811
      },
      {
        "총전입": 26525,
        "총전출": 27574,
        "순이동": -1049,
        "시도내이동-시군구내": 7150,
        "시도내이동-시군구간 전입": 10085,
        "시도내이동-시군구간 전출": 10085,
        "시도간전입": 9290,
        "시도간전출": 10339
      },
      {
        "총전입": 21823,
        "총전출": 22247,
        "순이동": -424,
        "시도내이동-시군구내": 6212,
        "시도내이동-시군구간 전입": 8775,
        "시도내이동-시군구간 전출": 8775,
        "시도간전입": 6836,
        "시도간전출": 7260
      },
      {
        "총전입": 22480,
        "총전출": 22204,
        "순이동": 276,
        "시도내이동-시군구내": 6203,
        "시도내이동-시군구간 전입": 9394,
        "시도내이동-시군구간 전출": 9394,
        "시도간전입": 6883,
        "시도간전출": 6607
      },
      {
        "총전입": 20871,
        "총전출": 21693,
        "순이동": -822,
        "시도내이동-시군구내": 6199,
        "시도내이동-시군구간 전입": 8883,
        "시도내이동-시군구간 전출": 8883,
        "시도간전입": 5789,
        "시도간전출": 6611
      },
      {
        "총전입": 19413,
        "총전출": 19865,
        "순이동": -452,
        "시도내이동-시군구내": 5845,
        "시도내이동-시군구간 전입": 7681,
        "시도내이동-시군구간 전출": 7681,
        "시도간전입": 5887,
        "시도간전출": 6339
      },
      {
        "총전입": 19288,
        "총전출": 19961,
        "순이동": -673,
        "시도내이동-시군구내": 5624,
        "시도내이동-시군구간 전입": 7437,
        "시도내이동-시군구간 전출": 7437,
        "시도간전입": 6227,
        "시도간전출": 6900
      }
    ]
  },
  {
    "region": "인천광역시",
    "values": [
      {
        "총전입": 30085,
        "총전출": 28802,
        "순이동": 1283,
        "시도내이동-시군구내": 8459,
        "시도내이동-시군구간 전입": 8259,
        "시도내이동-시군구간 전출": 8259,
        "시도간전입": 13367,
        "시도간전출": 12084
      },
      {
        "총전입": 32481,
        "총전출": 31610,
        "순이동": 871,
        "시도내이동-시군구내": 9226,
        "시도내이동-시군구간 전입": 8528,
        "시도내이동-시군구간 전출": 8528,
        "시도간전입": 14727,
        "시도간전출": 13856
      },
      {
        "총전입": 34053,
        "총전출": 32467,
        "순이동": 1586,
        "시도내이동-시군구내": 9624,
        "시도내이동-시군구간 전입": 9119,
        "시도내이동-시군구간 전출": 9119,
        "시도간전입": 15310,
        "시도간전출": 13724
      },
      {
        "총전입": 30104,
        "총전출": 29128,
        "순이동": 976,
        "시도내이동-시군구내": 9581,
        "시도내이동-시군구간 전입": 8283,
        "시도내이동-시군구간 전출": 8283,
        "시도간전입": 12240,
        "시도간전출": 11264
      },
      {
        "총전입": 28617,
        "총전출": 27380,
        "순이동": 1237,
        "시도내이동-시군구내": 9212,
        "시도내이동-시군구간 전입": 7893,
        "시도내이동-시군구간 전출": 7893,
        "시도간전입": 11512,
        "시도간전출": 10275
      },
      {
        "총전입": 31626,
        "총전출": 29397,
        "순이동": 2229,
        "시도내이동-시군구내": 10210,
        "시도내이동-시군구간 전입": 8981,
        "시도내이동-시군구간 전출": 8981,
        "시도간전입": 12435,
        "시도간전출": 10206
      },
      {
        "총전입": 30979,
        "총전출": 28432,
        "순이동": 2547,
        "시도내이동-시군구내": 9315,
        "시도내이동-시군구간 전입": 9119,
        "시도내이동-시군구간 전출": 9119,
        "시도간전입": 12545,
        "시도간전출": 9998
      },
      {
        "총전입": 30030,
        "총전출": 27760,
        "순이동": 2270,
        "시도내이동-시군구내": 8881,
        "시도내이동-시군구간 전입": 8646,
        "시도내이동-시군구간 전출": 8646,
        "시도간전입": 12503,
        "시도간전출": 10233
      }
    ]
  },
  {
    "region": "광주광역시",
    "values": [
      {
        "총전입": 14720,
        "총전출": 15859,
        "순이동": -1139,
        "시도내이동-시군구내": 4347,
        "시도내이동-시군구간 전입": 4996,
        "시도내이동-시군구간 전출": 4996,
        "시도간전입": 5377,
        "시도간전출": 6516
      },
      {
        "총전입": 15665,
        "총전출": 16952,
        "순이동": -1287,
        "시도내이동-시군구내": 4439,
        "시도내이동-시군구간 전입": 5372,
        "시도내이동-시군구간 전출": 5372,
        "시도간전입": 5854,
        "시도간전출": 7141
      },
      {
        "총전입": 14825,
        "총전출": 16372,
        "순이동": -1547,
        "시도내이동-시군구내": 4541,
        "시도내이동-시군구간 전입": 4607,
        "시도내이동-시군구간 전출": 4607,
        "시도간전입": 5677,
        "시도간전출": 7224
      },
      {
        "총전입": 15142,
        "총전출": 16055,
        "순이동": -913,
        "시도내이동-시군구내": 5291,
        "시도내이동-시군구간 전입": 5403,
        "시도내이동-시군구간 전출": 5403,
        "시도간전입": 4448,
        "시도간전출": 5361
      },
      {
        "총전입": 14045,
        "총전출": 14184,
        "순이동": -139,
        "시도내이동-시군구내": 4627,
        "시도내이동-시군구간 전입": 4907,
        "시도내이동-시군구간 전출": 4907,
        "시도간전입": 4511,
        "시도간전출": 4650
      },
      {
        "총전입": 13876,
        "총전출": 14668,
        "순이동": -792,
        "시도내이동-시군구내": 4757,
        "시도내이동-시군구간 전입": 4977,
        "시도내이동-시군구간 전출": 4977,
        "시도간전입": 4142,
        "시도간전출": 4934
      },
      {
        "총전입": 0,
        "총전출": 0,
        "순이동": 0,
        "시도내이동-시군구내": 0,
        "시도내이동-시군구간 전입": 0,
        "시도내이동-시군구간 전출": 0,
        "시도간전입": 0,
        "시도간전출": 0
      },
      {
        "총전입": 0,
        "총전출": 0,
        "순이동": 0,
        "시도내이동-시군구내": 0,
        "시도내이동-시군구간 전입": 0,
        "시도내이동-시군구간 전출": 0,
        "시도간전입": 0,
        "시도간전출": 0
      }
    ]
  },
  {
    "region": "대전광역시",
    "values": [
      {
        "총전입": 18958,
        "총전출": 19064,
        "순이동": -106,
        "시도내이동-시군구내": 4794,
        "시도내이동-시군구간 전입": 6015,
        "시도내이동-시군구간 전출": 6015,
        "시도간전입": 8149,
        "시도간전출": 8255
      },
      {
        "총전입": 20920,
        "총전출": 20007,
        "순이동": 913,
        "시도내이동-시군구내": 4628,
        "시도내이동-시군구간 전입": 5879,
        "시도내이동-시군구간 전출": 5879,
        "시도간전입": 10413,
        "시도간전출": 9500
      },
      {
        "총전입": 19906,
        "총전출": 19595,
        "순이동": 311,
        "시도내이동-시군구내": 4989,
        "시도내이동-시군구간 전입": 5803,
        "시도내이동-시군구간 전출": 5803,
        "시도간전입": 9114,
        "시도간전출": 8803
      },
      {
        "총전입": 14740,
        "총전출": 14827,
        "순이동": -87,
        "시도내이동-시군구내": 4038,
        "시도내이동-시군구간 전입": 4608,
        "시도내이동-시군구간 전출": 4608,
        "시도간전입": 6094,
        "시도간전출": 6181
      },
      {
        "총전입": 13975,
        "총전출": 13462,
        "순이동": 513,
        "시도내이동-시군구내": 3793,
        "시도내이동-시군구간 전입": 4172,
        "시도내이동-시군구간 전출": 4172,
        "시도간전입": 6010,
        "시도간전출": 5497
      },
      {
        "총전입": 14913,
        "총전출": 15068,
        "순이동": -155,
        "시도내이동-시군구내": 4574,
        "시도내이동-시군구간 전입": 4926,
        "시도내이동-시군구간 전출": 4926,
        "시도간전입": 5413,
        "시도간전출": 5568
      },
      {
        "총전입": 14927,
        "총전출": 14825,
        "순이동": 102,
        "시도내이동-시군구내": 4279,
        "시도내이동-시군구간 전입": 4992,
        "시도내이동-시군구간 전출": 4992,
        "시도간전입": 5656,
        "시도간전출": 5554
      },
      {
        "총전입": 15747,
        "총전출": 15197,
        "순이동": 550,
        "시도내이동-시군구내": 4232,
        "시도내이동-시군구간 전입": 5232,
        "시도내이동-시군구간 전출": 5232,
        "시도간전입": 6283,
        "시도간전출": 5733
      }
    ]
  },
  {
    "region": "울산광역시",
    "values": [
      {
        "총전입": 11484,
        "총전출": 12096,
        "순이동": -612,
        "시도내이동-시군구내": 3541,
        "시도내이동-시군구간 전입": 3983,
        "시도내이동-시군구간 전출": 3983,
        "시도간전입": 3960,
        "시도간전출": 4572
      },
      {
        "총전입": 11042,
        "총전출": 12452,
        "순이동": -1410,
        "시도내이동-시군구내": 3354,
        "시도내이동-시군구간 전입": 3530,
        "시도내이동-시군구간 전출": 3530,
        "시도간전입": 4158,
        "시도간전출": 5568
      },
      {
        "총전입": 10599,
        "총전출": 11742,
        "순이동": -1143,
        "시도내이동-시군구내": 3195,
        "시도내이동-시군구간 전입": 3380,
        "시도내이동-시군구간 전출": 3380,
        "시도간전입": 4024,
        "시도간전출": 5167
      },
      {
        "총전입": 8756,
        "총전출": 9414,
        "순이동": -658,
        "시도내이동-시군구내": 2927,
        "시도내이동-시군구간 전입": 2909,
        "시도내이동-시군구간 전출": 2909,
        "시도간전입": 2920,
        "시도간전출": 3578
      },
      {
        "총전입": 8178,
        "총전출": 8824,
        "순이동": -646,
        "시도내이동-시군구내": 2629,
        "시도내이동-시군구간 전입": 2762,
        "시도내이동-시군구간 전출": 2762,
        "시도간전입": 2787,
        "시도간전출": 3433
      },
      {
        "총전입": 8563,
        "총전출": 9019,
        "순이동": -456,
        "시도내이동-시군구내": 2911,
        "시도내이동-시군구간 전입": 2788,
        "시도내이동-시군구간 전출": 2788,
        "시도간전입": 2864,
        "시도간전출": 3320
      },
      {
        "총전입": 9013,
        "총전출": 9390,
        "순이동": -377,
        "시도내이동-시군구내": 2900,
        "시도내이동-시군구간 전입": 3130,
        "시도내이동-시군구간 전출": 3130,
        "시도간전입": 2983,
        "시도간전출": 3360
      },
      {
        "총전입": 8855,
        "총전출": 9268,
        "순이동": -413,
        "시도내이동-시군구내": 2832,
        "시도내이동-시군구간 전입": 2990,
        "시도내이동-시군구간 전출": 2990,
        "시도간전입": 3033,
        "시도간전출": 3446
      }
    ]
  },
  {
    "region": "세종특별자치시",
    "values": [
      {
        "총전입": 5523,
        "총전출": 6156,
        "순이동": -633,
        "시도내이동-시군구내": 2034,
        "시도내이동-시군구간 전입": 0,
        "시도내이동-시군구간 전출": 0,
        "시도간전입": 3489,
        "시도간전출": 4122
      },
      {
        "총전입": 5883,
        "총전출": 6234,
        "순이동": -351,
        "시도내이동-시군구내": 2109,
        "시도내이동-시군구간 전입": 0,
        "시도내이동-시군구간 전출": 0,
        "시도간전입": 3774,
        "시도간전출": 4125
      },
      {
        "총전입": 4865,
        "총전출": 5175,
        "순이동": -310,
        "시도내이동-시군구내": 1599,
        "시도내이동-시군구간 전입": 0,
        "시도내이동-시군구간 전출": 0,
        "시도간전입": 3266,
        "시도간전출": 3576
      },
      {
        "총전입": 3671,
        "총전출": 3853,
        "순이동": -182,
        "시도내이동-시군구내": 1260,
        "시도내이동-시군구간 전입": 0,
        "시도내이동-시군구간 전출": 0,
        "시도간전입": 2411,
        "시도간전출": 2593
      },
      {
        "총전입": 3361,
        "총전출": 3475,
        "순이동": -114,
        "시도내이동-시군구내": 1246,
        "시도내이동-시군구간 전입": 0,
        "시도내이동-시군구간 전출": 0,
        "시도간전입": 2115,
        "시도간전출": 2229
      },
      {
        "총전입": 3259,
        "총전출": 3535,
        "순이동": -276,
        "시도내이동-시군구내": 1207,
        "시도내이동-시군구간 전입": 0,
        "시도내이동-시군구간 전출": 0,
        "시도간전입": 2052,
        "시도간전출": 2328
      },
      {
        "총전입": 3696,
        "총전출": 3818,
        "순이동": -122,
        "시도내이동-시군구내": 1377,
        "시도내이동-시군구간 전입": 0,
        "시도내이동-시군구간 전출": 0,
        "시도간전입": 2319,
        "시도간전출": 2441
      },
      {
        "총전입": 3610,
        "총전출": 3961,
        "순이동": -351,
        "시도내이동-시군구내": 1308,
        "시도내이동-시군구간 전입": 0,
        "시도내이동-시군구간 전출": 0,
        "시도간전입": 2302,
        "시도간전출": 2653
      }
    ]
  },
  {
    "region": "경기도",
    "values": [
      {
        "총전입": 151964,
        "총전출": 146611,
        "순이동": 5353,
        "시도내이동-시군구내": 53303,
        "시도내이동-시군구간 전입": 45873,
        "시도내이동-시군구간 전출": 45873,
        "시도간전입": 52788,
        "시도간전출": 47435
      },
      {
        "총전입": 161503,
        "총전출": 157075,
        "순이동": 4428,
        "시도내이동-시군구내": 55269,
        "시도내이동-시군구간 전입": 48511,
        "시도내이동-시군구간 전출": 48511,
        "시도간전입": 57723,
        "시도간전출": 53295
      },
      {
        "총전입": 162769,
        "총전출": 160604,
        "순이동": 2165,
        "시도내이동-시군구내": 58711,
        "시도내이동-시군구간 전입": 47894,
        "시도내이동-시군구간 전출": 47894,
        "시도간전입": 56164,
        "시도간전출": 53999
      },
      {
        "총전입": 142610,
        "총전출": 138813,
        "순이동": 3797,
        "시도내이동-시군구내": 53621,
        "시도내이동-시군구간 전입": 42775,
        "시도내이동-시군구간 전출": 42775,
        "시도간전입": 46214,
        "시도간전출": 42417
      },
      {
        "총전입": 130658,
        "총전출": 128225,
        "순이동": 2433,
        "시도내이동-시군구내": 49371,
        "시도내이동-시군구간 전입": 40042,
        "시도내이동-시군구간 전출": 40042,
        "시도간전입": 41245,
        "시도간전출": 38812
      },
      {
        "총전입": 136112,
        "총전출": 130951,
        "순이동": 5161,
        "시도내이동-시군구내": 50866,
        "시도내이동-시군구간 전입": 41623,
        "시도내이동-시군구간 전출": 41623,
        "시도간전입": 43623,
        "시도간전출": 38462
      },
      {
        "총전입": 132930,
        "총전출": 127824,
        "순이동": 5106,
        "시도내이동-시군구내": 48796,
        "시도내이동-시군구간 전입": 40627,
        "시도내이동-시군구간 전출": 40627,
        "시도간전입": 43507,
        "시도간전출": 38401
      },
      {
        "총전입": 134282,
        "총전출": 129796,
        "순이동": 4486,
        "시도내이동-시군구내": 49034,
        "시도내이동-시군구간 전입": 40520,
        "시도내이동-시군구간 전출": 40520,
        "시도간전입": 44728,
        "시도간전출": 40242
      }
    ]
  },
  {
    "region": "강원특별자치도",
    "values": [
      {
        "총전입": 16457,
        "총전출": 16677,
        "순이동": -220,
        "시도내이동-시군구내": 6761,
        "시도내이동-시군구간 전입": 3113,
        "시도내이동-시군구간 전출": 3113,
        "시도간전입": 6583,
        "시도간전출": 6803
      },
      {
        "총전입": 17787,
        "총전출": 18179,
        "순이동": -392,
        "시도내이동-시군구내": 6608,
        "시도내이동-시군구간 전입": 3672,
        "시도내이동-시군구간 전출": 3672,
        "시도간전입": 7507,
        "시도간전출": 7899
      },
      {
        "총전입": 19227,
        "총전출": 18478,
        "순이동": 749,
        "시도내이동-시군구내": 7651,
        "시도내이동-시군구간 전입": 3530,
        "시도내이동-시군구간 전출": 3530,
        "시도간전입": 8046,
        "시도간전출": 7297
      },
      {
        "총전입": 14994,
        "총전출": 14215,
        "순이동": 779,
        "시도내이동-시군구내": 6657,
        "시도내이동-시군구간 전입": 2346,
        "시도내이동-시군구간 전출": 2346,
        "시도간전입": 5991,
        "시도간전출": 5212
      },
      {
        "총전입": 12950,
        "총전출": 12408,
        "순이동": 542,
        "시도내이동-시군구내": 5526,
        "시도내이동-시군구간 전입": 2222,
        "시도내이동-시군구간 전출": 2222,
        "시도간전입": 5202,
        "시도간전출": 4660
      },
      {
        "총전입": 13027,
        "총전출": 12582,
        "순이동": 445,
        "시도내이동-시군구내": 5609,
        "시도내이동-시군구간 전입": 2180,
        "시도내이동-시군구간 전출": 2180,
        "시도간전입": 5238,
        "시도간전출": 4793
      },
      {
        "총전입": 13923,
        "총전출": 13454,
        "순이동": 469,
        "시도내이동-시군구내": 6380,
        "시도내이동-시군구간 전입": 2187,
        "시도내이동-시군구간 전출": 2187,
        "시도간전입": 5356,
        "시도간전출": 4887
      },
      {
        "총전입": 13172,
        "총전출": 13196,
        "순이동": -24,
        "시도내이동-시군구내": 6050,
        "시도내이동-시군구간 전입": 2022,
        "시도내이동-시군구간 전출": 2022,
        "시도간전입": 5100,
        "시도간전출": 5124
      }
    ]
  },
  {
    "region": "충청북도",
    "values": [
      {
        "총전입": 17541,
        "총전출": 16898,
        "순이동": 643,
        "시도내이동-시군구내": 7387,
        "시도내이동-시군구간 전입": 2510,
        "시도내이동-시군구간 전출": 2510,
        "시도간전입": 7644,
        "시도간전출": 7001
      },
      {
        "총전입": 20362,
        "총전출": 19932,
        "순이동": 430,
        "시도내이동-시군구내": 9312,
        "시도내이동-시군구간 전입": 2553,
        "시도내이동-시군구간 전출": 2553,
        "시도간전입": 8497,
        "시도간전출": 8067
      },
      {
        "총전입": 20712,
        "총전출": 19179,
        "순이동": 1533,
        "시도내이동-시군구내": 8633,
        "시도내이동-시군구간 전입": 2536,
        "시도내이동-시군구간 전출": 2536,
        "시도간전입": 9543,
        "시도간전출": 8010
      },
      {
        "총전입": 15649,
        "총전출": 14004,
        "순이동": 1645,
        "시도내이동-시군구내": 6628,
        "시도내이동-시군구간 전입": 1846,
        "시도내이동-시군구간 전출": 1846,
        "시도간전입": 7175,
        "시도간전출": 5530
      },
      {
        "총전입": 15284,
        "총전출": 14184,
        "순이동": 1100,
        "시도내이동-시군구내": 7046,
        "시도내이동-시군구간 전입": 1847,
        "시도내이동-시군구간 전출": 1847,
        "시도간전입": 6391,
        "시도간전출": 5291
      },
      {
        "총전입": 15675,
        "총전출": 14812,
        "순이동": 863,
        "시도내이동-시군구내": 7577,
        "시도내이동-시군구간 전입": 1901,
        "시도내이동-시군구간 전출": 1901,
        "시도간전입": 6197,
        "시도간전출": 5334
      },
      {
        "총전입": 13981,
        "총전출": 13320,
        "순이동": 661,
        "시도내이동-시군구내": 6437,
        "시도내이동-시군구간 전입": 1772,
        "시도내이동-시군구간 전출": 1772,
        "시도간전입": 5772,
        "시도간전출": 5111
      },
      {
        "총전입": 14084,
        "총전출": 13522,
        "순이동": 562,
        "시도내이동-시군구내": 6787,
        "시도내이동-시군구간 전입": 1522,
        "시도내이동-시군구간 전출": 1522,
        "시도간전입": 5775,
        "시도간전출": 5213
      }
    ]
  },
  {
    "region": "충청남도",
    "values": [
      {
        "총전입": 22727,
        "총전출": 22635,
        "순이동": 92,
        "시도내이동-시군구내": 7665,
        "시도내이동-시군구간 전입": 4076,
        "시도내이동-시군구간 전출": 4076,
        "시도간전입": 10986,
        "시도간전출": 10894
      },
      {
        "총전입": 24688,
        "총전출": 24209,
        "순이동": 479,
        "시도내이동-시군구내": 7599,
        "시도내이동-시군구간 전입": 4572,
        "시도내이동-시군구간 전출": 4572,
        "시도간전입": 12517,
        "시도간전출": 12038
      },
      {
        "총전입": 26465,
        "총전출": 25064,
        "순이동": 1401,
        "시도내이동-시군구내": 8840,
        "시도내이동-시군구간 전입": 4611,
        "시도내이동-시군구간 전출": 4611,
        "시도간전입": 13014,
        "시도간전출": 11613
      },
      {
        "총전입": 21777,
        "총전출": 20409,
        "순이동": 1368,
        "시도내이동-시군구내": 8122,
        "시도내이동-시군구간 전입": 3499,
        "시도내이동-시군구간 전출": 3499,
        "시도간전입": 10156,
        "시도간전출": 8788
      },
      {
        "총전입": 19491,
        "총전출": 18207,
        "순이동": 1284,
        "시도내이동-시군구내": 7296,
        "시도내이동-시군구간 전입": 3068,
        "시도내이동-시군구간 전출": 3068,
        "시도간전입": 9127,
        "시도간전출": 7843
      },
      {
        "총전입": 18507,
        "총전출": 17721,
        "순이동": 786,
        "시도내이동-시군구내": 7185,
        "시도내이동-시군구간 전입": 2856,
        "시도내이동-시군구간 전출": 2856,
        "시도간전입": 8466,
        "시도간전출": 7680
      },
      {
        "총전입": 16936,
        "총전출": 16232,
        "순이동": 704,
        "시도내이동-시군구내": 6120,
        "시도내이동-시군구간 전입": 2693,
        "시도내이동-시군구간 전출": 2693,
        "시도간전입": 8123,
        "시도간전출": 7419
      },
      {
        "총전입": 18033,
        "총전출": 17593,
        "순이동": 440,
        "시도내이동-시군구내": 6507,
        "시도내이동-시군구간 전입": 3044,
        "시도내이동-시군구간 전출": 3044,
        "시도간전입": 8482,
        "시도간전출": 8042
      }
    ]
  },
  {
    "region": "전북특별자치도",
    "values": [
      {
        "총전입": 18380,
        "총전출": 18969,
        "순이동": -589,
        "시도내이동-시군구내": 8742,
        "시도내이동-시군구간 전입": 4348,
        "시도내이동-시군구간 전출": 4348,
        "시도간전입": 5290,
        "시도간전출": 5879
      },
      {
        "총전입": 18377,
        "총전출": 19271,
        "순이동": -894,
        "시도내이동-시군구내": 8011,
        "시도내이동-시군구간 전입": 4192,
        "시도내이동-시군구간 전출": 4192,
        "시도간전입": 6174,
        "시도간전출": 7068
      },
      {
        "총전입": 19453,
        "총전출": 19752,
        "순이동": -299,
        "시도내이동-시군구내": 8198,
        "시도내이동-시군구간 전입": 4659,
        "시도내이동-시군구간 전출": 4659,
        "시도간전입": 6596,
        "시도간전출": 6895
      },
      {
        "총전입": 15819,
        "총전출": 15730,
        "순이동": 89,
        "시도내이동-시군구내": 7491,
        "시도내이동-시군구간 전입": 3578,
        "시도내이동-시군구간 전출": 3578,
        "시도간전입": 4750,
        "시도간전출": 4661
      },
      {
        "총전입": 13821,
        "총전출": 14042,
        "순이동": -221,
        "시도내이동-시군구내": 6599,
        "시도내이동-시군구간 전입": 3093,
        "시도내이동-시군구간 전출": 3093,
        "시도간전입": 4129,
        "시도간전출": 4350
      },
      {
        "총전입": 15603,
        "총전출": 15750,
        "순이동": -147,
        "시도내이동-시군구내": 7760,
        "시도내이동-시군구간 전입": 3632,
        "시도내이동-시군구간 전출": 3632,
        "시도간전입": 4211,
        "시도간전출": 4358
      },
      {
        "총전입": 14194,
        "총전출": 14316,
        "순이동": -122,
        "시도내이동-시군구내": 6870,
        "시도내이동-시군구간 전입": 3214,
        "시도내이동-시군구간 전출": 3214,
        "시도간전입": 4110,
        "시도간전출": 4232
      },
      {
        "총전입": 13877,
        "총전출": 14166,
        "순이동": -289,
        "시도내이동-시군구내": 6747,
        "시도내이동-시군구간 전입": 2904,
        "시도내이동-시군구간 전출": 2904,
        "시도간전입": 4226,
        "시도간전출": 4515
      }
    ]
  },
  {
    "region": "전라남도",
    "values": [
      {
        "총전입": 16233,
        "총전출": 16312,
        "순이동": -79,
        "시도내이동-시군구내": 5392,
        "시도내이동-시군구간 전입": 3868,
        "시도내이동-시군구간 전출": 3868,
        "시도간전입": 6973,
        "시도간전출": 7052
      },
      {
        "총전입": 15793,
        "총전출": 16634,
        "순이동": -841,
        "시도내이동-시군구내": 5047,
        "시도내이동-시군구간 전입": 3858,
        "시도내이동-시군구간 전출": 3858,
        "시도간전입": 6888,
        "시도간전출": 7729
      },
      {
        "총전입": 17155,
        "총전출": 17733,
        "순이동": -578,
        "시도내이동-시군구내": 5805,
        "시도내이동-시군구간 전입": 4025,
        "시도내이동-시군구간 전출": 4025,
        "시도간전입": 7325,
        "시도간전출": 7903
      },
      {
        "총전입": 14427,
        "총전출": 13823,
        "순이동": 604,
        "시도내이동-시군구내": 5118,
        "시도내이동-시군구간 전입": 2959,
        "시도내이동-시군구간 전출": 2959,
        "시도간전입": 6350,
        "시도간전출": 5746
      },
      {
        "총전입": 12644,
        "총전출": 13001,
        "순이동": -357,
        "시도내이동-시군구내": 4747,
        "시도내이동-시군구간 전입": 2735,
        "시도내이동-시군구간 전출": 2735,
        "시도간전입": 5162,
        "시도간전출": 5519
      },
      {
        "총전입": 14231,
        "총전출": 13877,
        "순이동": 354,
        "시도내이동-시군구내": 4916,
        "시도내이동-시군구간 전입": 3434,
        "시도내이동-시군구간 전출": 3434,
        "시도간전입": 5881,
        "시도간전출": 5527
      },
      {
        "총전입": 0,
        "총전출": 0,
        "순이동": 0,
        "시도내이동-시군구내": 0,
        "시도내이동-시군구간 전입": 0,
        "시도내이동-시군구간 전출": 0,
        "시도간전입": 0,
        "시도간전출": 0
      },
      {
        "총전입": 0,
        "총전출": 0,
        "순이동": 0,
        "시도내이동-시군구내": 0,
        "시도내이동-시군구간 전입": 0,
        "시도내이동-시군구간 전출": 0,
        "시도간전입": 0,
        "시도간전출": 0
      }
    ]
  },
  {
    "region": "경상북도",
    "values": [
      {
        "총전입": 24634,
        "총전출": 26167,
        "순이동": -1533,
        "시도내이동-시군구내": 9514,
        "시도내이동-시군구간 전입": 4791,
        "시도내이동-시군구간 전출": 4791,
        "시도간전입": 10329,
        "시도간전출": 11862
      },
      {
        "총전입": 24335,
        "총전출": 26346,
        "순이동": -2011,
        "시도내이동-시군구내": 8149,
        "시도내이동-시군구간 전입": 4680,
        "시도내이동-시군구간 전출": 4680,
        "시도간전입": 11506,
        "시도간전출": 13517
      },
      {
        "총전입": 27305,
        "총전출": 27241,
        "순이동": 64,
        "시도내이동-시군구내": 9071,
        "시도내이동-시군구간 전입": 5458,
        "시도내이동-시군구간 전출": 5458,
        "시도간전입": 12776,
        "시도간전출": 12712
      },
      {
        "총전입": 21047,
        "총전출": 20949,
        "순이동": 98,
        "시도내이동-시군구내": 8002,
        "시도내이동-시군구간 전입": 3762,
        "시도내이동-시군구간 전출": 3762,
        "시도간전입": 9283,
        "시도간전출": 9185
      },
      {
        "총전입": 18906,
        "총전출": 19569,
        "순이동": -663,
        "시도내이동-시군구내": 7455,
        "시도내이동-시군구간 전입": 3272,
        "시도내이동-시군구간 전출": 3272,
        "시도간전입": 8179,
        "시도간전출": 8842
      },
      {
        "총전입": 21580,
        "총전출": 21420,
        "순이동": 160,
        "시도내이동-시군구내": 9646,
        "시도내이동-시군구간 전입": 3711,
        "시도내이동-시군구간 전출": 3711,
        "시도간전입": 8223,
        "시도간전출": 8063
      },
      {
        "총전입": 18875,
        "총전출": 19332,
        "순이동": -457,
        "시도내이동-시군구내": 8217,
        "시도내이동-시군구간 전입": 3094,
        "시도내이동-시군구간 전출": 3094,
        "시도간전입": 7564,
        "시도간전출": 8021
      },
      {
        "총전입": 17538,
        "총전출": 18350,
        "순이동": -812,
        "시도내이동-시군구내": 6909,
        "시도내이동-시군구간 전입": 2931,
        "시도내이동-시군구간 전출": 2931,
        "시도간전입": 7698,
        "시도간전출": 8510
      }
    ]
  },
  {
    "region": "경상남도",
    "values": [
      {
        "총전입": 29165,
        "총전출": 29770,
        "순이동": -605,
        "시도내이동-시군구내": 12073,
        "시도내이동-시군구간 전입": 6143,
        "시도내이동-시군구간 전출": 6143,
        "시도간전입": 10949,
        "시도간전출": 11554
      },
      {
        "총전입": 30837,
        "총전출": 34291,
        "순이동": -3454,
        "시도내이동-시군구내": 12312,
        "시도내이동-시군구간 전입": 6960,
        "시도내이동-시군구간 전출": 6960,
        "시도간전입": 11565,
        "시도간전출": 15019
      },
      {
        "총전입": 33912,
        "총전출": 35560,
        "순이동": -1648,
        "시도내이동-시군구내": 14602,
        "시도내이동-시군구간 전입": 7395,
        "시도내이동-시군구간 전출": 7395,
        "시도간전입": 11915,
        "시도간전출": 13563
      },
      {
        "총전입": 25849,
        "총전출": 25686,
        "순이동": 163,
        "시도내이동-시군구내": 12291,
        "시도내이동-시군구간 전입": 4884,
        "시도내이동-시군구간 전출": 4884,
        "시도간전입": 8674,
        "시도간전출": 8511
      },
      {
        "총전입": 22910,
        "총전출": 23300,
        "순이동": -390,
        "시도내이동-시군구내": 10708,
        "시도내이동-시군구간 전입": 4336,
        "시도내이동-시군구간 전출": 4336,
        "시도간전입": 7866,
        "시도간전출": 8256
      },
      {
        "총전입": 25284,
        "총전출": 25713,
        "순이동": -429,
        "시도내이동-시군구내": 12582,
        "시도내이동-시군구간 전입": 4662,
        "시도내이동-시군구간 전출": 4662,
        "시도간전입": 8040,
        "시도간전출": 8469
      },
      {
        "총전입": 22946,
        "총전출": 23759,
        "순이동": -813,
        "시도내이동-시군구내": 10795,
        "시도내이동-시군구간 전입": 4332,
        "시도내이동-시군구간 전출": 4332,
        "시도간전입": 7819,
        "시도간전출": 8632
      },
      {
        "총전입": 21289,
        "총전출": 22519,
        "순이동": -1230,
        "시도내이동-시군구내": 9413,
        "시도내이동-시군구간 전입": 4081,
        "시도내이동-시군구간 전출": 4081,
        "시도간전입": 7795,
        "시도간전출": 9025
      }
    ]
  },
  {
    "region": "제주특별자치도",
    "values": [
      {
        "총전입": 7449,
        "총전출": 8104,
        "순이동": -655,
        "시도내이동-시군구내": 4006,
        "시도내이동-시군구간 전입": 756,
        "시도내이동-시군구간 전출": 756,
        "시도간전입": 2687,
        "시도간전출": 3342
      },
      {
        "총전입": 7889,
        "총전출": 8329,
        "순이동": -440,
        "시도내이동-시군구내": 3750,
        "시도내이동-시군구간 전입": 860,
        "시도내이동-시군구간 전출": 860,
        "시도간전입": 3279,
        "시도간전출": 3719
      },
      {
        "총전입": 7864,
        "총전출": 8111,
        "순이동": -247,
        "시도내이동-시군구내": 4000,
        "시도내이동-시군구간 전입": 789,
        "시도내이동-시군구간 전출": 789,
        "시도간전입": 3075,
        "시도간전출": 3322
      },
      {
        "총전입": 6311,
        "총전출": 6185,
        "순이동": 126,
        "시도내이동-시군구내": 3217,
        "시도내이동-시군구간 전입": 674,
        "시도내이동-시군구간 전출": 674,
        "시도간전입": 2420,
        "시도간전출": 2294
      },
      {
        "총전입": 5741,
        "총전출": 5968,
        "순이동": -227,
        "시도내이동-시군구내": 3057,
        "시도내이동-시군구간 전입": 559,
        "시도내이동-시군구간 전출": 559,
        "시도간전입": 2125,
        "시도간전출": 2352
      },
      {
        "총전입": 5662,
        "총전출": 5737,
        "순이동": -75,
        "시도내이동-시군구내": 3069,
        "시도내이동-시군구간 전입": 525,
        "시도내이동-시군구간 전출": 525,
        "시도간전입": 2068,
        "시도간전출": 2143
      },
      {
        "총전입": 5719,
        "총전출": 5752,
        "순이동": -33,
        "시도내이동-시군구내": 2956,
        "시도내이동-시군구간 전입": 596,
        "시도내이동-시군구간 전출": 596,
        "시도간전입": 2167,
        "시도간전출": 2200
      },
      {
        "총전입": 5607,
        "총전출": 5510,
        "순이동": 97,
        "시도내이동-시군구내": 2679,
        "시도내이동-시군구간 전입": 504,
        "시도내이동-시군구간 전출": 504,
        "시도간전입": 2424,
        "시도간전출": 2327
      }
    ]
  }
] as const;
